# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
# а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки 
# были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

# coins = int(input("Введите количество монеток: "))
# count0 = 0
# count1 = 0
# for i in range(coins):
#     a = int(input("Введите значение 1 или 0: "))
#     if a == 0:
#         count0 +=1
#     else:
#         count1 +=1

# if count0 > count1:
#     print(count1)
# else:
#     print(count0)




# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.

# s = int(input("Введите сумму чисел: "))
# p = int(input("Введите произведение чисел: "))
# x = ''
# y = ''
# for x in range(1, 1001, 1):
#     for y in range(1, 1001, 1):
#         if x + y == s and x * y == p:
#             print("Первое число" ,x, "Второе число" ,y,) 

# Не смог понять почему вывод значений идет 2 раза





# Задача 14: Требуется вывести все целые степени двойки (т.е. числа
# вида 2k), не превосходящие числа N.


# n = int(input("Введите значение n: "))
# p = 1
# while p <= n:
#      print(p, end= ' ')
#      p = p*2
   

   
